stangsdal/zmartify-hvac-nilan/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_FREERTOS_HZ=1000
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_NILAN_ENABLE_DEV_OTA=y
CONFIG_NILAN_ENABLE_DEV_DIAGNOSTICS=y
CONFIG_NILAN_ENABLE_DEV_WRITES=y
CONFIG_NILAN_ENABLE_MQTT_COMMANDS=y
